IdeaRS.OpenModel.Detail.Opening
Representation of opening in IDEA StatiCa Detail

IdeaRS.OpenModel.Detail.Opening.#ctor
Constructor

IdeaRS.OpenModel.Detail.Opening.Name
Name

IdeaRS.OpenModel.Detail.Opening.GeomId
Id representing geometrical parts of Detail

IdeaRS.OpenModel.Detail.Opening.MasterComponent
Master component

IdeaRS.OpenModel.Detail.Opening.MasterPoint
Master point 0 - 9

IdeaRS.OpenModel.Detail.Opening.InsertPoint
Insert point 0 - 9

IdeaRS.OpenModel.Detail.Opening.Outline
Outline of Oopening

IdeaRS.OpenModel.Detail.Opening.Position
Offset between MasterPoint and InsertPoint
If MasterPoint is null, position is from origin of coordinate system